test/integration/data.pyvmomi.clone/request-5.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <RetrievePropertiesEx xmlns="urn:vim25">
      <_this type="PropertyCollector">propertyCollector</_this>
      <specSet>
        <propSet>
          <type>ContainerView</type>
          <all>false</all>
          <pathSet>view</pathSet>
        </propSet>
        <objectSet>
          <obj type="ContainerView">session[cdb5ee03-1491-8188-e42b-469c307bfbb7]52644bf0-d356-28e5-cbad-4e99f54c1386</obj>
          <skip>false</skip>
        </objectSet>
      </specSet>
      <options>
        <maxObjects>1</maxObjects>
      </options>
    </RetrievePropertiesEx>
  </soapenv:Body>
</soapenv:Envelope>
